In [1]:
import pandas as pd

In [9]:
people = {
    'name': ['Dipen', 'Hites', 'mally'],
    'age':[29,10,40],
    'gender':['male','male','female'],
    'graduate':[False, True, True],
    'hobbies': [['cricket','football','chess','suduko'], ['swiming','travel','reading'],['chess','walk']]
}
df_people = pd.DataFrame(people)
df_people

    name  age  gender  graduate                             hobbies
0  Dipen   29    male     False  [cricket, football, chess, suduko]
1  Hites   10    male      True          [swiming, travel, reading]
2  mally   40  female      True                       [chess, walk]

In [10]:
filter = (df_people['age'] > 25) 

df_people[filter] # OR 
df_people.loc[filter][['name','age']]

    name  age
0  Dipen   29
2  mally   40

In [13]:
df_people.columns = [x.upper() for x in df_people.columns]
df_people

    NAME  AGE  GENDER  GRADUATE                             HOBBIES
0  Dipen   29    male     False  [cricket, football, chess, suduko]
1  Hites   10    male      True          [swiming, travel, reading]
2  mally   40  female      True                       [chess, walk]

In [15]:
df_people.rename(columns={'NAME':'Name', 'GRADUATE':'is_cool'}, inplace=True)
df_people

    Name  AGE  GENDER  is_cool                             HOBBIES
0  Dipen   29    male    False  [cricket, football, chess, suduko]
1  Hites   10    male     True          [swiming, travel, reading]
2  mally   40  female     True                       [chess, walk]

In [16]:
df_people.loc[3] = ['Sunny', 50, 'gay', False, []]
df_people.loc[2, ['Name','GENDER']] = ['Miles Moris', 'male']
df_people

          Name  AGE GENDER  is_cool                             HOBBIES
0        Dipen   29   male    False  [cricket, football, chess, suduko]
1        Hites   10   male     True          [swiming, travel, reading]
2  Miles Moris   40   male     True                       [chess, walk]
3        Sunny   50    gay    False                                  []